{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Demo: Ingestion de Documentos\n",
    "\n",
    "Este notebook demuestra cómo procesar documentos y construir un grafo de conocimiento."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/Pablo/Universidad/02-segundo-cuatrimestre/IAC/GraphRAG-IAC/.venv/lib/python3.12/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "from dotenv import load_dotenv\n",
    "sys.path.append('..')\n",
    "load_dotenv(\"../env/.env\")\n",
    "\n",
    "from graphrag.graph.neo4j_manager import Neo4jManager\n",
    "from graphrag.ingestion.text_processor import TextProcessor\n",
    "from graphrag.ingestion.graph_cleaner import GraphCleaner"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. Inicializar Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j = Neo4jManager()\n",
    "neo4j.create_constraints()\n",
    "neo4j.create_vector_index()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total animals: 100\n",
      "['Tiger', 'Lion', 'Elephant', 'Dolphin', 'Giant Panda', 'Horse', 'Penguin', 'Wolf', 'Shark', 'Rabbit', 'Gorilla', 'Giraffe', 'Cheetah', 'Polar Bear', 'Hippopotamus', 'Zebra', 'Red Panda', 'Kangaroo', 'Koala', 'Sloth', 'Meerkat', 'Rhinoceros', 'Snow Leopard', 'Orangutan', 'Chimpanzee', 'Platypus', 'Lemur', 'Capybara', 'Sea Otter', 'Arctic Fox', 'Jaguar', 'Black Panther', 'Brown Bear', 'Okapi', 'Tasmanian Devil', 'Wombat', 'Quokka', 'Hedgehog', 'Fennec Fox', 'Bald Eagle', 'Peacock', 'Flamingo', 'Parrot', 'Hummingbird', 'Swan', 'Toucan', 'Owl', 'Puffin', 'Woodpecker', 'Raven', 'Falcon', 'Ostrich', 'Emu', 'Albatross', 'Robin', 'Blue Jay', 'Cardinal', 'Canary', 'Guinea Pig', 'Hamster', 'Cow', 'Pig', 'Sheep', 'Goat', 'Chicken', 'Duck', 'Donkey', 'Llama', 'Alpaca', 'Ferret', 'Chinchilla', 'Great White Shark', 'Blue Whale', 'Killer Whale (Orca)', 'Sea Turtle', 'Octopus', 'Seahorse', 'Clownfish', 'Axolotl', 'Manatee', 'Stingray', 'Walrus', 'Seal', 'Narwhal', 'Lobster', 'Jellyfish', 'Chameleon', 'Komodo Dragon', 'King Cobra', 'Bearded Dragon', 'Green Iguana', 'Tree Frog', 'Monarch Butterfly', 'Honey Bee', 'Praying Mantis', 'Ladybug', 'Raccoon', 'Camel', 'Squirrel', 'Buffalo']\n"
     ]
    }
   ],
   "source": [
    "animals = [\n",
    "    \"Tiger\", \"Lion\", \"Elephant\", \"Dolphin\", \"Giant Panda\", \"Horse\", \"Penguin\", \"Wolf\", \"Shark\", \"Rabbit\",\n",
    "    \"Gorilla\", \"Giraffe\", \"Cheetah\", \"Polar Bear\", \"Hippopotamus\", \"Zebra\", \"Red Panda\", \"Kangaroo\", \"Koala\", \"Sloth\",\n",
    "    \"Meerkat\", \"Rhinoceros\", \"Snow Leopard\", \"Orangutan\", \"Chimpanzee\", \"Platypus\", \"Lemur\", \"Capybara\", \"Sea Otter\", \"Arctic Fox\",\n",
    "    \"Jaguar\", \"Black Panther\", \"Brown Bear\", \"Okapi\", \"Tasmanian Devil\", \"Wombat\", \"Quokka\", \"Hedgehog\", \"Fennec Fox\", \"Bald Eagle\",\n",
    "    \"Peacock\", \"Flamingo\", \"Parrot\", \"Hummingbird\", \"Swan\", \"Toucan\", \"Owl\", \"Puffin\", \"Woodpecker\", \"Raven\",\n",
    "    \"Falcon\", \"Ostrich\", \"Emu\", \"Albatross\", \"Robin\", \"Blue Jay\", \"Cardinal\", \"Canary\", \"Guinea Pig\", \"Hamster\",\n",
    "    \"Cow\", \"Pig\", \"Sheep\", \"Goat\", \"Chicken\", \"Duck\", \"Donkey\", \"Llama\", \"Alpaca\", \"Ferret\",\n",
    "    \"Chinchilla\", \"Great White Shark\", \"Blue Whale\", \"Killer Whale (Orca)\", \"Sea Turtle\", \"Octopus\", \"Seahorse\", \"Clownfish\", \"Axolotl\", \"Manatee\",\n",
    "    \"Stingray\", \"Walrus\", \"Seal\", \"Narwhal\", \"Lobster\", \"Jellyfish\", \"Chameleon\", \"Komodo Dragon\", \"King Cobra\", \"Bearded Dragon\",\n",
    "    \"Green Iguana\", \"Tree Frog\", \"Monarch Butterfly\", \"Honey Bee\", \"Praying Mantis\", \"Ladybug\", \"Raccoon\", \"Camel\", \"Squirrel\", \"Buffalo\"\n",
    "]\n",
    "\n",
    "print(f\"Total animals: {len(animals)}\")\n",
    "print(animals)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. Cargar documento de ejemplo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "# Lion\n",
      "\n",
      "## Lion Facts\n",
      "\n",
      "#### The lion is Africa’s apex predator\n",
      "\n",
      "The lion is one of the largest, strongest, and most powerful felines in the world, second only in size to the Siberian Tiger. They are the largest cats on the African continent.\n",
      "\n",
      "While most big cats are solitary hunters, lions are incredibly sociable animals that live together in family groups called pride.\n",
      "\n",
      "They are some of the world’s most popular animals :\n",
      "\n",
      "## Scientific Name and Classification\n",
      "\n",
      "The scientific name for lions is Panthera leo . The genus Panthera is of Greek origin and comprises big cat species such as tigers , lions, jaguars , and leopards that have the ability to roar. Leo is the Latin word for lion.\n",
      "\n",
      "There are two types of lion subspecies. One is named Panthera leo melanochaita and lives across South and East Africa. The second lion subspecies has the scientific name Panther Leo and lives in West Africa, Central Africa, and Asia.\n",
      "\n",
      "You may see references to African and Asiatic lions. Up until 2017, there were two recognized subspecies, the African and Asiatic lions, but scientists reclassified lions that year. For more information on the types of lions see our full lion classification guide .\n",
      "\n",
      "## Evolution and Origins\n",
      "\n",
      "Lions among most members of the cat family are thought to be descended from a common ancestor known as the Proailurus Lemanensis , which translates to “first cat”. This ancient creature was a cat-like creature that walked the earth nearly 25 million years ago.\n",
      "\n",
      "Fossil evidence suggests that the earliest lion-like cat appeared in Laetoli in Tanzania in East Africa during the Late Pliocene (5.0–1.8 million years ago).\n",
      "\n",
      "Additionally, genetic studies suggest that the lion evolved in eastern and southern Africa.\n",
      "\n",
      "## Incredible Lion Facts!\n",
      "\n",
      "- The lion animal is considered one of the “African Big Five.”\n",
      "- The largest lion ever recorded weighed 690 pounds and was shot in South Africa in 1936. Ancient lions were even larger than today’s largest lions, and reached up to 1,153 pounds!\n",
      "- Between 1993-2014, the IUCN estimated the population of lions decreased by 42% . Due to poaching and habitat loss, it is estimated there may be fewer than 20,000 lions left today .\n",
      "- While lions are generally social animals, prides generally consist of 80% females. For this reason, only about one in eight male lions survive to adulthood. Groups of male lions sometimes band together, controlling vast swaths of territory. One famous band of male lions in South Africa’s Kruger National Park controlled over 170,000 acres and was estimated to kill more than 100 rival lions and cubs.\n",
      "- Lions are animals that have long been kept in zoos and in captivity. In 18th century England, the price of admission to the Tower Menagerie (the precursor to the London Zoo) was three pence for a cat or dog to be fed to the lions !\n",
      "\n",
      "For our full list of incredible lion facts, see our 13 mind-blowing lion facts page.\n",
      "\n",
      "## Anatomy and Appearance\n",
      "\n",
      "Lions have a short coat of tawny or golden fur with a long tail that has a tuft of longer fur at the end. The markings on their coats are much fainter than the bold stripes and spots displayed on other felines which helps these large carnivores in going unseen when stalking prey in the long grasses.\n",
      "\n",
      "Lions have strong and powerful jaws that contain 30 teeth in total which include four fang-like canines and four carnassial teeth that are perfectly designed for slicing through flesh.\n",
      "\n",
      "### Mane\n",
      "\n",
      "The lion animal is one of the largest cats in the world with males being taller and heavier than females and displaying a mane of long hair around their faces (in fact, it is the only case in the feline world where males and females actually look different).\n",
      "\n",
      "Thought to be connected with testosterone levels, the mane of the male lion ranges from blonde to red, brown, and black in color and covers the head, neck, and chest.\n",
      "\n",
      "### White Lions\n",
      "\n",
      "Several big cat species have been observed in the wild with color mutations, such as the white tiger or black panther . Likewise, there is an uncommon color mutation in lions that leaves their coat extremely pale.\n",
      "\n",
      "Unlike white tigers which are albino – that is, lacking in color pigments in their coat – the coat of white lions is caused by recessive traits. The uncommon nature of white lions led to them being captured and moved into captivity in the second half of the 20th century.\n",
      "\n",
      "Today, white lions are bred across many zoos and wildlife parks. For example, in North America, six white lions are located at Parc Safari near Montreal, Quebec as of 2020. However, they’re now being reintroduced back into environments in South Africa and are successfully breeding and hunting in their native environments.\n",
      "\n",
      "## Distribution and Habitat\n",
      "\n",
      "Historically, lions would have been found throughout much of Africa and even in parts of Europe and Asia as well.\n",
      "\n",
      "Today, however, they have been pushed into more isolated pockets of their once vast natural range with the remaining African Lion population now only found in countries in sub-Saharan Africa. There is also still a small population of Asiatic Lions found inhabiting a remote part of the Gir Forest in India.\n",
      "\n",
      "Despite their dwindling numbers, lions are actually incredibly adaptable animals that can and will inhabit very dry climates as they get most of the moisture they need from their food.\n",
      "\n",
      "They prefer areas of open woodland, scrub, and long grasslands where there is not only plenty of covers but also a wide variety of prey. They are only not found in areas of rainforest or far into deserts.\n",
      "\n",
      "## Population – How Many White Lions Are Left?\n",
      "\n",
      "Like other big cat species, the lion is under threat from habitat loss and hunting. Between 1993 and 2014, the population of lions decreased by 42%. The IUCN’s last assessment places the adult population between 23,000 to 39,000 mature individuals. Today, lions as a species are listed as “Vulnerable,” a step above being declared “Endangered.”\n",
      "\n",
      "While the African lion’s population likely numbers over 20,000, Asiatic lion populations are estimated to number just 600 individuals. Asiatic lions are limited to just a single wildlife sanctuary in India that measures just 545 square miles (1,400 sq. km). Further growth in the population of Asiatic lions will rely on reintroduction into new habitats in India.\n",
      "\n",
      "### Species and subpopulations\n",
      "\n",
      "Scientists believe that 10,000 years ago lion animals were the most widespread mammal outside of humans. However, today their range is a fraction of its historical size. This comes from the extinction of two unique lion species near the end of the last ice age and habitat loss that has reduced the range of lions\n",
      "\n",
      "#### Barbary\n",
      "\n",
      "The Barbary lion used to live across the North Coast of Africa, with a range that stretched from Egypt to Morocco. Until recently, it was believed to be a distinct subspecies of lion, but research now shows it’s genetically similar to Asiatic lions.\n",
      "\n",
      "The Barbary lion was largely hunted to extinction in the 19th century. The last documented sighting was in Algeria’s Atlas Mountains in 1942 (although, skins were found on illegal markets into the 1980s, suggesting the Barbary lions may have survived longer), leaving the lion regionally extinct in North Africa. Today, Barbary lions aren’t recognized as unique subspecies, but for much of the 20th century, they were believed to be.\n",
      "\n",
      "#### Cape\n",
      "\n",
      "The Cape lion used to live in South Africa and was defined by a darker mane than many other lion populations. Today, the Cape Lion is recognized as a subpopulation rather than a different species or subspecies. There have been no lions found in the Cape lion’s range since 1858.\n",
      "\n",
      "#### Cave ( Panthera leo spelaea )\n",
      "\n",
      "The Cave lion was a species of lion that stretched across Eurasia and into Alaska and went extinct with the collapse of the mammoth steppe about 12,000 years ago. The species lived across all of continental Europe and many archeological drawings of lions from that area depict cave lions. The species was larger than today’s surviving lions. In recent years, a number of frozen cave lion cubs have been discovered in Russia’s permafrost.\n",
      "\n",
      "#### American ( Panthera leo atrox )\n",
      "\n",
      "Another lion species that disappeared roughly 12,000 years ago during a period of global climate change, the American lion’s range stretched across most of the modern-day United States and Mexico.\n",
      "\n",
      "The American lion is notable for being the largest lion species. Its habitat was similar to today’s African lion, with it hunting across large grasslands on large mammals like bison, deer , and even mammoths.\n",
      "\n",
      "## Behavior and Lifestyle\n",
      "\n",
      "Lions are unique among cats as they live together in strong social groups. A pride is made up of 5-15 related females and their cubs along with a generally single male (small groups of 2 or 3 though are not uncommon). Male lions patrol a territory of around 100m² marking trees and rocks with urine and roaring to warn off intruders.\n",
      "\n",
      "Although male lions can defend their pride to great effect, their position in the pride is constantly under threat from other males who try to take over their patch and if successful, they will kill any cubs that were sired by the previous male.\n",
      "\n",
      "Despite their enormous size, male lions actually do hardly any of the hunting as they are often slower and more easily seen than their female counterparts.\n",
      "\n",
      "The Lionesses in the pride hunt together meaning that they are not only more successful on their trips, but they are also able to catch and kill animals that are both faster than them and much bigger.\n",
      "\n",
      "### Roar\n",
      "\n",
      "Lion roars can be extremely loud, reaching about 114 decibels in volume. Their roar is loud enough to breach the pain threshold of human hearing! Lion roars are louder than any big cat, and can be heard from a distance of about 5 miles away (8 km).\n",
      "\n",
      "The ability to roar at such a high volume is due to unique adaptations in the lion’s vocal folds. Lions generally roar as a warning and to defend their territories. Beyond warning off males, lion roars also allow members of the pride to find one another as its sound can travel such long distances.\n",
      "\n",
      "## Reproduction, Cubs, and Lifespan\n",
      "\n",
      "Both male and female lions are able to reproduce between the ages of two and three but despite this, they will often not breed until the pride has been firmly established.\n",
      "\n",
      "After a gestation period that lasts for nearly four months, female lions give birth to between one and six cubs that are born blind and are incredibly vulnerable in their new surroundings. The fur of lion cubs is covered in darker spots that help to camouflage them into their den to protect them whilst the adults have gone out to hunt.\n",
      "\n",
      "Sadly, however, less than half of cubs make it to be a year old and four out of five have died by the time they are two, generally either from animal attacks or starvation. Remarkably though, the female lions in the pride will have their cubs at around the same time and will help to suckle and care for the cubs of other females.\n",
      "\n",
      "Lion cubs suckle on milk until they are about six months old and although they won’t begin actively hunting until they are about a year old, lion cubs start to eat meat after 12 weeks or so.\n",
      "\n",
      "Like most big cats, lions live about 10 to 15 years. In captivity, lions have lived quite a bit longer than in the wild. In 2016, the Philadelphia Zoo had to euthanize a 25-year-old female lion after it began suffering from limited mobility.\n",
      "\n",
      "## Diet and Prey\n",
      "\n",
      "The Lion is a large and carnivorous animal that survives only by eating other animals in order to sustain itself. Lions eat a diet that consists of buffalo, wildebeests, and even giraffes . Depending on the abundance and variety of prey species within their territory, Lions primarily catch gazelle, zebra, and warthog along with a number of antelope species by following the herds across the open grasslands.\n",
      "\n",
      "They will not turn their noses up though at hunting alone should the situation arise and will happily steal the kill of another animal.\n",
      "\n",
      "Once the animal has been caught though, circumstances change as the females will allow the male Lion to eat first before indulging themselves. The cubs however are at the bottom of the pile and have to be content with what remains once the adults have finished.\n",
      "\n",
      "Unlike other felines, lions are not solitary hunters instead, the lionesses work together in order to chase down and catch their prey with each female having a different strategic role. This strategy allows them to kill animals that are both faster and much larger than they are.\n",
      "\n",
      "A study of 1,300 lion hunts found that when hunting individually, their success rate on hunts was 17-19%. However, when hunting in groups, success rates jumped to 30%.\n",
      "\n",
      "On average, lions eat about 17 to 20 lbs (8 to 9 kg) of meat per day. Males can about 100 pounds in a day (43 kg), while females can eat 55 pounds (25 kg).\n",
      "\n",
      "For a complete analysis of the diet of lions, make sure to read ‘ What Do Lions Eat? 15 Foods They Hunt. ‘\n",
      "\n",
      "## Predators and Threats\n",
      "\n",
      "The lion is the most dominant predator within its environment meaning that other animals pose little or no threat to them, with the exception of hyena packs that can cause fatal damage to lions particularly when they are on their own and food is about.\n",
      "\n",
      "Lions are seen as a great threat by many other species including both giraffes and elephants which are easily capable of fatally injuring a lion to try and warn it off.\n",
      "\n",
      "More than other species, the significant threat to lions is other lions. In South Africa’s Sabi Sands a group of male lions formed a coalition that’s believed to have killed more than 100 lions across a territory that eventually ranged across 170,000 acres.\n",
      "\n",
      "Male lions will often kill one another while attempting to seize control of pride and then will also kill cubs of pride to ensure a gene pool that’s not theirs is passed on.\n",
      "\n",
      "Lion numbers have also been severely affected by diseases passed through hyenas from wild dogs , with more than 1,000 lions having died from canine distemper between 1993 and 1997.\n",
      "\n",
      "### Relationship with Humans\n",
      "\n",
      "However, the biggest threat to lions is people who not only kill them out of fear (and historically as trophies) and the encroachment of agriculture and cities.\n",
      "\n",
      "Lions have been admired and feared by people for centuries, but due to both hunting and growing human settlements, lions have been wiped out from a vast portion of their historical natural range.\n",
      "\n",
      "Although they do not naturally see people as prey, African Lions have been known to sneak into villages (sometimes of great size) to find food, and are known to attack up to 700 people every year, with Lions being responsible for 100 human fatalities annually in Tanzania alone.\n",
      "\n",
      "In 1898, two Lions in Kenya (known as Tsavo lions – a pair of mane-less Lions) became famous for killing and eating over 130 rail-road workers over a period of around 9 months.\n",
      "\n",
      "### 3 more lion facts\n",
      "\n",
      "Remember to read our full lion facts page to get a full list of the most incredible facts on this remarkable species. You’ll find facts like:\n",
      "\n",
      "#### Young lions practice hunting by role-playing!\n",
      "\n",
      "Young Lion cubs spend a great deal of time playing together which actually helps them to develop their hunting techniques. This method of role-playing in cubs also helps females to determine whether or not they would be suited better to chasing and cornering prey, or catching and killing it.\n",
      "\n",
      "#### Lions have small hearts and lungs and must rely on stealth and teamwork\n",
      "\n",
      "The Lion has large paws with soft pads underneath and sharp retractable claws on the end of each toe which aid them in running, climbing, and catching their prey along with also being good defense mechanisms. The structure of their feet and legs means that they are also able to jump distances over 10 meters.\n",
      "\n",
      "Lionhearts weigh about 1,175 grams, which in relation to their body size is significantly smaller than many of the herbivores they hunt. Their heart and lung size mean lions can only exert themselves for small distances and must rely on teamwork and sneaking up close to prey before beginning their hunt.\n",
      "\n",
      "#### The world’s most famous lion survived a plane crash\n",
      "\n",
      "One of the most famous depictions of a lion is the roaring lion at the start of films from MGM studios. To raise publicity for this lion, in 1927 MGM flew their mascot across the country, but on a flight from San Diego to New York, the plane crashed.\n",
      "\n",
      "The original MGM lion survived the plane crash and survived four days on a diet of sandwiches and milk!\n"
     ]
    }
   ],
   "source": [
    "FILE_PATH = \"../scraping/data/lion.md\"\n",
    "with open(FILE_PATH, 'r', encoding='utf-8') as f:\n",
    "    markdown_text = f.read()\n",
    "\n",
    "print(markdown_text)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3. Procesar documento"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Documento dividido en 1 chunks\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Procesando chunks:   0%|          | 0/1 [00:00<?, ?it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Initial extraction: 5 entities and 5 relationships\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Procesando chunks:   0%|          | 0/1 [00:07<?, ?it/s]\n"
     ]
    },
    {
     "ename": "ValidationError",
     "evalue": "1 validation error for GraphPatch\n  JSON input should be string, bytes or bytearray [type=json_type, input_value=None, input_type=NoneType]\n    For further information visit https://errors.pydantic.dev/2.12/v/json_type",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mValidationError\u001b[39m                           Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[5]\u001b[39m\u001b[32m, line 3\u001b[39m\n\u001b[32m      1\u001b[39m processor = TextProcessor(neo4j_manager=neo4j, species_names=animals, chunk_size=\u001b[32m800\u001b[39m, chunk_overlap=\u001b[32m80\u001b[39m)\n\u001b[32m----> \u001b[39m\u001b[32m3\u001b[39m \u001b[43mprocessor\u001b[49m\u001b[43m.\u001b[49m\u001b[43mprocess_document\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m      4\u001b[39m \u001b[43m    \u001b[49m\u001b[43mtext\u001b[49m\u001b[43m=\u001b[49m\u001b[43mmarkdown_text\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m      5\u001b[39m \u001b[43m    \u001b[49m\u001b[43mdocument_id\u001b[49m\u001b[43m=\u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mlion\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\n\u001b[32m      6\u001b[39m \u001b[43m    \u001b[49m\u001b[43mmetadata\u001b[49m\u001b[43m=\u001b[49m\u001b[43m{\u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mtitle\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mLion\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43msource\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mA-Z Animals\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m}\u001b[49m\n\u001b[32m      7\u001b[39m \u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Universidad/02-segundo-cuatrimestre/IAC/GraphRAG-IAC/notebooks/../graphrag/ingestion/text_processor.py:77\u001b[39m, in \u001b[36mTextProcessor.process_document\u001b[39m\u001b[34m(self, text, document_id, metadata)\u001b[39m\n\u001b[32m     75\u001b[39m \u001b[38;5;28;01mfor\u001b[39;00m i, chunk \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28menumerate\u001b[39m(tqdm(chunks, desc=\u001b[33m\"\u001b[39m\u001b[33mProcesando chunks\u001b[39m\u001b[33m\"\u001b[39m), start=\u001b[32m25\u001b[39m):\n\u001b[32m     76\u001b[39m     chunk_id = \u001b[33mf\u001b[39m\u001b[33m\"\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mdocument_id\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m_chunk_\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mi\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m\"\u001b[39m\n\u001b[32m---> \u001b[39m\u001b[32m77\u001b[39m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_process_chunk\u001b[49m\u001b[43m(\u001b[49m\u001b[43mchunk_id\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mchunk\u001b[49m\u001b[43m.\u001b[49m\u001b[43mpage_content\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mchunk\u001b[49m\u001b[43m.\u001b[49m\u001b[43mmetadata\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mdocument_id\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mi\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m     78\u001b[39m     time.sleep(\u001b[32m5\u001b[39m)\n\u001b[32m     80\u001b[39m \u001b[38;5;66;03m# 4. Consolidar entidades y relaciones\u001b[39;00m\n\u001b[32m     81\u001b[39m \u001b[38;5;66;03m# self._consolidate_entities()\u001b[39;00m\n\u001b[32m     82\u001b[39m \u001b[38;5;66;03m# self._consolidate_relationships()\u001b[39;00m\n\u001b[32m     83\u001b[39m \n\u001b[32m     84\u001b[39m \u001b[38;5;66;03m# Limpiar el grafo para eliminar nodos o relaciones inconsistentes\u001b[39;00m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Universidad/02-segundo-cuatrimestre/IAC/GraphRAG-IAC/notebooks/../graphrag/ingestion/text_processor.py:134\u001b[39m, in \u001b[36mTextProcessor._process_chunk\u001b[39m\u001b[34m(self, chunk_id, text, metadata, document_id, index)\u001b[39m\n\u001b[32m    131\u001b[39m \u001b[38;5;66;03m# Extraer entidades y relaciones\u001b[39;00m\n\u001b[32m    132\u001b[39m tmp_entities, tmp_relationships = \u001b[38;5;28mself\u001b[39m.entity_extractor.extract_entities_and_relationships(text)\n\u001b[32m--> \u001b[39m\u001b[32m134\u001b[39m entities, relationships = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43mentity_extractor\u001b[49m\u001b[43m.\u001b[49m\u001b[43mreview_extraction\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtext\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtmp_entities\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtmp_relationships\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    136\u001b[39m \u001b[38;5;66;03m# Almacenar entidades\u001b[39;00m\n\u001b[32m    137\u001b[39m \u001b[38;5;28;01mfor\u001b[39;00m label, entities_list \u001b[38;5;129;01min\u001b[39;00m entities.items():\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Universidad/02-segundo-cuatrimestre/IAC/GraphRAG-IAC/notebooks/../graphrag/ingestion/entity_extractor.py:476\u001b[39m, in \u001b[36mEntityExtractor.review_extraction\u001b[39m\u001b[34m(self, text, entities, relationships)\u001b[39m\n\u001b[32m    451\u001b[39m \u001b[38;5;66;03m#         prompt = f\"\"\"Compare the ORIGINAL TEXT against the INITIAL EXTRACTION (Entites and Relationships).\u001b[39;00m\n\u001b[32m    452\u001b[39m \u001b[38;5;66;03m# Output ONLY the specific items that need to be deleted (hallucinations/redundancies) and the specific NEW items that need to be added. Do not rewrite correct existing data.\u001b[39;00m\n\u001b[32m    453\u001b[39m \n\u001b[32m   (...)\u001b[39m\u001b[32m    460\u001b[39m \u001b[38;5;66;03m# --- INITIAL RELATIONSHIPS ---\u001b[39;00m\n\u001b[32m    461\u001b[39m \u001b[38;5;66;03m# {initial_relations_json}\"\"\"\u001b[39;00m\n\u001b[32m    463\u001b[39m         prompt = \u001b[33mf\u001b[39m\u001b[33m\"\"\"\u001b[39m\u001b[33mExecute your audit on the data below.\u001b[39m\n\u001b[32m    464\u001b[39m \n\u001b[32m    465\u001b[39m \u001b[33mSTEP 1: Perform the [HALLUCINATION CHECK]. Read the INITIAL EXTRACTION. If a data point is not explicitly in the TEXT, or contradicts it, mark it for deletion in your thought process.\u001b[39m\n\u001b[32m   (...)\u001b[39m\u001b[32m    473\u001b[39m \u001b[38;5;132;01m{\u001b[39;00minitial_entities_json\u001b[38;5;132;01m}\u001b[39;00m\n\u001b[32m    474\u001b[39m \u001b[38;5;132;01m{\u001b[39;00minitial_relations_json\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m\"\"\"\u001b[39m\n\u001b[32m--> \u001b[39m\u001b[32m476\u001b[39m         extraction: GraphPatch = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43mclient\u001b[49m\u001b[43m.\u001b[49m\u001b[43mstructured_output\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m    477\u001b[39m \u001b[43m            \u001b[49m\u001b[43mprompt\u001b[49m\u001b[43m=\u001b[49m\u001b[43mprompt\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    478\u001b[39m \u001b[43m            \u001b[49m\u001b[43mschema\u001b[49m\u001b[43m=\u001b[49m\u001b[43mGraphPatch\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    479\u001b[39m \u001b[43m            \u001b[49m\u001b[43msystem_prompt\u001b[49m\u001b[43m=\u001b[49m\u001b[43msystem_prompt\u001b[49m\n\u001b[32m    480\u001b[39m \u001b[43m        \u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    482\u001b[39m         \u001b[38;5;66;03m# ==========================================\u001b[39;00m\n\u001b[32m    483\u001b[39m         \u001b[38;5;66;03m# 1. PROCESAR ELIMINACIONES (ALUCINACIONES)\u001b[39;00m\n\u001b[32m    484\u001b[39m         \u001b[38;5;66;03m# ==========================================\u001b[39;00m\n\u001b[32m    485\u001b[39m         \n\u001b[32m    486\u001b[39m         \u001b[38;5;66;03m# Eliminar entidades\u001b[39;00m\n\u001b[32m    487\u001b[39m         \u001b[38;5;28;01mfor\u001b[39;00m entity_ptr \u001b[38;5;129;01min\u001b[39;00m extraction.entities_to_delete:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Universidad/02-segundo-cuatrimestre/IAC/GraphRAG-IAC/notebooks/../graphrag/llm/gemini_client.py:107\u001b[39m, in \u001b[36mGeminiClient.structured_output\u001b[39m\u001b[34m(self, prompt, schema, system_prompt, model)\u001b[39m\n\u001b[32m    100\u001b[39m \u001b[38;5;66;03m# Para un único prompt, podemos pasar el string directamente\u001b[39;00m\n\u001b[32m    101\u001b[39m response = \u001b[38;5;28mself\u001b[39m.client.models.generate_content(\n\u001b[32m    102\u001b[39m     model=model_name,\n\u001b[32m    103\u001b[39m     contents=prompt,\n\u001b[32m    104\u001b[39m     config=config\n\u001b[32m    105\u001b[39m )\n\u001b[32m--> \u001b[39m\u001b[32m107\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mschema\u001b[49m\u001b[43m.\u001b[49m\u001b[43mmodel_validate_json\u001b[49m\u001b[43m(\u001b[49m\u001b[43mresponse\u001b[49m\u001b[43m.\u001b[49m\u001b[43mtext\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/Universidad/02-segundo-cuatrimestre/IAC/GraphRAG-IAC/.venv/lib/python3.12/site-packages/pydantic/main.py:766\u001b[39m, in \u001b[36mBaseModel.model_validate_json\u001b[39m\u001b[34m(cls, json_data, strict, extra, context, by_alias, by_name)\u001b[39m\n\u001b[32m    760\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m by_alias \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m \u001b[38;5;129;01mand\u001b[39;00m by_name \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28;01mTrue\u001b[39;00m:\n\u001b[32m    761\u001b[39m     \u001b[38;5;28;01mraise\u001b[39;00m PydanticUserError(\n\u001b[32m    762\u001b[39m         \u001b[33m'\u001b[39m\u001b[33mAt least one of `by_alias` or `by_name` must be set to True.\u001b[39m\u001b[33m'\u001b[39m,\n\u001b[32m    763\u001b[39m         code=\u001b[33m'\u001b[39m\u001b[33mvalidate-by-alias-and-name-false\u001b[39m\u001b[33m'\u001b[39m,\n\u001b[32m    764\u001b[39m     )\n\u001b[32m--> \u001b[39m\u001b[32m766\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mcls\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m__pydantic_validator__\u001b[49m\u001b[43m.\u001b[49m\u001b[43mvalidate_json\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m    767\u001b[39m \u001b[43m    \u001b[49m\u001b[43mjson_data\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mstrict\u001b[49m\u001b[43m=\u001b[49m\u001b[43mstrict\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mextra\u001b[49m\u001b[43m=\u001b[49m\u001b[43mextra\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mcontext\u001b[49m\u001b[43m=\u001b[49m\u001b[43mcontext\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mby_alias\u001b[49m\u001b[43m=\u001b[49m\u001b[43mby_alias\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mby_name\u001b[49m\u001b[43m=\u001b[49m\u001b[43mby_name\u001b[49m\n\u001b[32m    768\u001b[39m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[31mValidationError\u001b[39m: 1 validation error for GraphPatch\n  JSON input should be string, bytes or bytearray [type=json_type, input_value=None, input_type=NoneType]\n    For further information visit https://errors.pydantic.dev/2.12/v/json_type"
     ]
    }
   ],
   "source": [
    "processor = TextProcessor(neo4j_manager=neo4j, species_names=animals, chunk_size=800, chunk_overlap=80)\n",
    "\n",
    "processor.process_document(\n",
    "    text=markdown_text,\n",
    "    document_id=\"lion\",\n",
    "    metadata={\"title\": \"Lion\", \"source\": \"A-Z Animals\"}\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 4. Verificar el grafo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Chunk: 33\n",
      "Species: 14\n",
      "Location: 14\n",
      "Habitat: 8\n",
      "ConservationStatus: 4\n",
      "FoodSource: 4\n",
      "SocialStructure: 3\n",
      "ActivityCycle: 2\n",
      "Document: 1\n",
      "Family: 1\n",
      "AnimalClass: 1\n",
      "SkeletalStructure: 1\n",
      "ReproductionMethod: 1\n",
      "EnvironmentType: 1\n",
      "DietType: 1\n"
     ]
    }
   ],
   "source": [
    "# Contar nodos\n",
    "stats = neo4j.execute_query(\"\"\"\n",
    "MATCH (n)\n",
    "RETURN labels(n)[0] as label, count(*) as count\n",
    "ORDER BY count DESC\n",
    "\"\"\")\n",
    "\n",
    "for stat in stats:\n",
    "    print(f\"{stat['label']}: {stat['count']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Entity` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=10, offset=10>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 10, 'line': 2, 'column': 10}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (e:Entity)\\nRETURN e.name as name\\nLIMIT 10\\n'\n"
     ]
    }
   ],
   "source": [
    "# Ver algunas entidades\n",
    "entities = neo4j.execute_query(\"\"\"\n",
    "MATCH (e:Entity)\n",
    "RETURN e.name as name\n",
    "LIMIT 10\n",
    "\"\"\")\n",
    "\n",
    "for entity in entities:\n",
    "    print(f\"\\n{entity['name']} ({entity['type']})\")\n",
    "    print(f\"  {entity['summary'][:100]}...\" if entity['summary'] else \"  No summary\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Ver algunas relaciones\n",
    "relationships = neo4j.execute_query(\"\"\"\n",
    "MATCH (s:Entity)-[r:RELATIONSHIP]->(t:Entity)\n",
    "RETURN s.name as source, r.type as type, t.name as target, r.summary as summary\n",
    "LIMIT 10\n",
    "\"\"\")\n",
    "\n",
    "for rel in relationships:\n",
    "    print(f\"\\n{rel['source']} -[{rel['type']}]-> {rel['target']}\")\n",
    "    print(f\"  {rel['summary'][:100]}...\" if rel['summary'] else \"  No summary\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 5. Cleanup (opcional)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Descomentar para limpiar la base de datos\n",
    "# neo4j.execute_query(\"MATCH (n) DETACH DELETE n\")\n",
    "neo4j.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "graphrag-iac",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
